#B04208025/地理一/林芳偉

#Question 2

rm(list=ls(all=TRUE))

st <- 1:28 #st=編號
P <- c(1182,305,255.1,97.6,336.7,328.1,48.2,239,274.4,42.5,185.5,76.1,355.6,313.3,44.1,55.1,102.7,138.6,645.8,467.7,148.9,240.5,172.4,133.5,567.5,114.3,200.2,631.4) #P=月累積雨量

PL <- array(0,c(1,28)) #PL=可用水水量分類等級

for (i in 1:length(P))
  if(P[i]<150) {PL[i] <- 5
  } else if (P[i]>=150 & P[i]<300) {PL[i] <- 4
  } else if (P[i]>=300 & P[i]<450) {PL[i] <- 3
  } else if (P[i]>=450 & P[i]<600) {PL[i] <- 2
  } else if (P[i]>=600) {PL[i] <- 1}

PL <- as.integer(PL) #把PL轉換成整數

write.table(PL,"PL.txt",sep=",")